Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/удуПриказОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОЗачисленииРебенкаВГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗачисление</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуКомплектованиеГруппы/удуКомплектованиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуКомплектованиеГруппы</name>
  <registerRecords>InformationRegister.удуСведенияОКомплекатцииГруппы</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговораПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКомплектования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьКомплектация</name>
    <attributes>
      <name>ФормироватьДоговор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденВГруппу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.удуРодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаПоДоговору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорОЗачислении</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаЗачисление</name>
      <type>
        <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументыСформированы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПереходаИзДругойГруппы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнойПризнак</name>
      <type>
        <types>CatalogRef.удуВозрастныеПризнаки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДляЗачисления</name>
      <type>
        <types>CatalogRef.удуГруппыУчреждения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Catalogs/удуДети/удуДети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДети</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатусРебенка</name>
    <type>
      <types>EnumRef.удуСтатусРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.удуПол</types>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>РоднойЯзык</name>
    <type>
      <types>CatalogRef.удуЯзыкиНародовМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиСвидетельства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаРождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальноеПоложение</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСоциальныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотографияРебенка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьЗаголовокКомплектации(Комплектация)
	Возврат "Создан автоматически на основании комплектации №" + СокрЛП(Комплектация.Номер) + " от " + Формат(Комплектация.Дата, "ДЛФ=D");
КонецФункции

&НаСервере
Функция ПолучитьРебенкаИзДоговора(ПереданныйДоговор)
	Если ЗначениеЗаполнено(ПереданныйДоговор.Ребенок) Тогда
		Возврат ПереданныйДоговор.Ребенок;
	Иначе
		Возврат Справочники.удуДети.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьИмеющимисяДоговорамиНаСервере()
	ОбъектРеквизит = РеквизитФормыВЗначение("Объект");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуДоговорОЗачисленииРебенка.Ссылка,
	               |	удуДоговорОЗачисленииРебенка.Ребенок
	               |ИЗ
	               |	Документ.удуДоговорОЗачисленииРебенка КАК удуДоговорОЗачисленииРебенка
	               |ГДЕ
	               |	(НЕ удуДоговорОЗачисленииРебенка.ПометкаУдаления)
	               |	И (НЕ удуДоговорОЗачисленииРебенка.ПроизошлоЗачисление)
	               |	И удуДоговорОЗачисленииРебенка.Группа = &Группа";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Группа", ОбъектРеквизит.Группа);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ребенок", СтрокаРезультат.Ссылка.Ребенок);
		МассивНайденныхСтрок = ОбъектРеквизит.ТабличнаяЧастьЗачисление.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() = 0 Тогда
			НоваяСтрокаВоспитанники = ОбъектРеквизит.ТабличнаяЧастьЗачисление.Добавить();
			НоваяСтрокаВоспитанники.ОснованиеЗачисления = СтрокаРезультат.Ссылка;
			НоваяСтрокаВоспитанники.Ребенок = СтрокаРезультат.Ссылка.Ребенок;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектРеквизит, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОСоставеГруппы()
	// Отбор по учреждению
	сэРезультатВыполнения = удуОбработкаПросмотрИнформации.ПолучитьсоставГруппы(Объект.Группа, ТекущаяДата());
	ЗначениеВРеквизитФормы(сэРезультатВыполнения, "СоставВыбраннойГруппы");
	
	Если Объект.Группа.БезОграниченияВместительности Тогда
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы не ограничена.";
	Иначе
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы: " + Строка(Объект.Группа.Вместительность);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
		Объект.Учреждение = Константы.удуОсновноеУчреждение.Получить();
		Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
			ЭтаФорма.Элементы.Учреждение.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаФактическогоЗачисления) Тогда
		Объект.ДатаФактическогоЗачисления = ТекущаяДата();
	КонецЕсли;
	
	ОбновитьСведенияОСоставеГруппы();
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКандидатами(Команда)
	// Вставить содержимое обработчика.
	Если Объект.ТабличнаяЧастьЗачисление.Количество() > 0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена, Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.ТабличнаяЧастьЗачисление.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Группа) Тогда
		ЗаполнитьИмеющимисяДоговорамиНаСервере();	
	Иначе
		Вопрос("Перед заполнением табличной части обязательно укажите группу!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСведенияОСоставеГруппы();
КонецПроцедуры


&НаКлиенте
Процедура НадписьСведенияОГруппеНажатие(Элемент)
	// Вставить содержимое обработчика.
	Если СоставВыбраннойГруппы.Количество() > 0 Тогда 
		ФормаПросмотра = ПолучитьФорму("ОбщаяФорма.удуФормаПросмотраСоставаГруппы");	
		ФормаПросмотра.ВладелецФормы = ЭтаФорма;
		Для Каждого СтрокаСоставГруппы Из СоставВыбраннойГруппы Цикл
			НоваяСтрокаФормыПросмотра = ФормаПросмотра.ТабличнаяЧастьДети.Добавить();
			НоваяСтрокаФормыПросмотра.Ребенок = СтрокаСоставГруппы.Ребенок;
			НоваяСтрокаФормыПросмотра.Пол = СтрокаСоставГруппы.Пол;
			НоваяСтрокаФормыПросмотра.ДатаРождения = СтрокаСоставГруппы.ДатаРождения;
		КонецЦикла;
		ФормаПросмотра.ОткрытьМодально();		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаНомерДата.ТолькоПросмотр = Объект.Проведен;
	Элементы.ТабличнаяЧастьЗачисление.ТолькоПросмотр = Объект.Проведен;
	Элементы.Группа.ТолькоПросмотр = Объект.Проведен;
	Элементы.ОтключитьКонтрольВместимости.ТолькоПросмотр = Объект.Проведен;
	Если ЗначениеЗаполнено(Объект.ДокументКомплектация) Тогда
		Элементы.НадписьСведенияОКомплектации.Видимость = Истина;	
		Элементы.НадписьСведенияОКомплектации.Заголовок = ПолучитьЗаголовокКомплектации(Объект.ДокументКомплектация);
	Иначе
		Элементы.НадписьСведенияОКомплектации.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧастьЗачислениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	// Вставить содержимое обработчика.
	Если Копирование Тогда
		Вопрос("В табличную часть документа ""Приказ о зачислении"" сведения о детях нельзя вводить копированием!", РежимДиалогаВопрос.ОК);
		Отказ = истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Группа) Тогда
		Вопрос("Перед заполнением табличной части обязательно укажите группу!", РежимДиалогаВопрос.ОК);
		Отказ = истина;		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧастьЗачислениеОснованиеЗачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Группа) Тогда
		ФормаВыбораДоговора = ПолучитьФорму("ОбщаяФорма.удуФормаВыбораДоговора");
		ФормаВыбораДоговора.ПараметрГруппа = Объект.Группа;
		ФормаВыбораДоговора.ВладелецФормы = ЭтаФорма;
		ФормаВыбораДоговора.ОткрытьМодально();				
	Иначе
		Вопрос("Перед заполнением табличной части обязательно укажите группу!", РежимДиалогаВопрос.ОК);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.удуДоговорОЗачисленииРебенка") Тогда		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ОснованиеЗачисления", ВыбранноеЗначение);
		МассивНайденныхСтрок = Объект.ТабличнаяЧастьЗачисление.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() = 0 Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Ребенок", ПолучитьРебенкаИзДоговора(ВыбранноеЗначение));
			МассивНайденныхСтрок = Объект.ТабличнаяЧастьЗачисление.НайтиСтроки(СтруктураПоиска);
			Если МассивНайденныхСтрок.Количество() = 0 Тогда			
				Элементы.ТабличнаяЧастьЗачисление.ТекущиеДанные.ОснованиеЗачисления = ВыбранноеЗначение;
				Элементы.ТабличнаяЧастьЗачисление.ТекущиеДанные.Ребенок = ПолучитьРебенкаИзДоговора(ВыбранноеЗначение);
			Иначе
				Вопрос("В табличной части уже указан ребенок, договор на зачисление которого вы выбираете", РежимДиалогаВопрос.ОК);
			КонецЕсли;
		Иначе
			Вопрос("Выбранный договор на зачисление ребенка уже указан в документе", РежимДиалогаВопрос.ОК);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура НадписьСведенияОКомплектацииНажатие(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.ДокументКомплектация) Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Объект.ДокументКомплектация);
		ОткрытьФормуМодально("Документ.удуКомплектованиеГруппы.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);		
	КонецЕсли;	
КонецПроцедуры
